Tekla Open API Reference for Tekla Structures 2025
PointList.LastIndexOf Method (Point, Int32, Int32)
 Searches for the last occurence of the point in the list.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int LastIndexOf(
	Point value,
	int startIndex,
	int count
)
Public Function LastIndexOf (
	value As Point,
	startIndex As Integer,
	count As Integer
) As Integer
Parameters
value
Type: Tekla.Structures.Geometry3d.Point
The point to locate.
startIndex
Type: System.Int32
The index to start the search from.
count
Type: System.Int32
The number of items searched.
Return Value
Type: Int32
The last index of the point if found, otherwise -1.
See Also
Reference
PointList Class
LastIndexOf Overload
Tekla.Structures.Drawing Namespace